Tekla Open API Reference for Tekla Structures 2025
Tree Class
 The Tree class represents a tree view control that can contain images.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.TreeView
 Tekla.Structures.Dialog.UIControls.Tree
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class Tree : TreeView
Public Class Tree
	Inherits TreeView
The Tree type exposes the following members.
Constructors
Name | Description
Tree
 Initializes a new instance of the Tree class.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace